In [1]:
#创建series
import pandas as pd
obj =  pd.Series([4,7,-5,3])

In [2]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,7,-5,3],index = ['b','a','d','c'])
obj2

b    4
a    7
d   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['b', 'a', 'd', 'c'], dtype='object')

In [7]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [8]:
obj2['a']

7

In [9]:
obj2[['a','b','c']]            #与array一样可以用神奇索引

a    7
b    4
c    3
dtype: int64

In [10]:
obj2[obj2>0]

b    4
a    7
c    3
dtype: int64

In [11]:
obj2*2

b     8
a    14
d   -10
c     6
dtype: int64

In [12]:
import numpy as np
np.exp(obj2)

b      54.598150
a    1096.633158
d       0.006738
c      20.085537
dtype: float64

In [13]:
obj2>0

b     True
a     True
d    False
c     True
dtype: bool

In [14]:
'b'in obj2

True

In [15]:
'e'in obj2

False

In [16]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000,'utah':5000}        #用字典生成Series
obj3 = pd.Series(sdata)
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [17]:
states = ['california','ohio','oregon','texas']
obj4 = pd.Series(sdata,index = states)
obj4

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [18]:
pd.isnull(obj4)        #pandas用isnull和notnull函数来检查缺失数据

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
texas          True
dtype: bool

In [20]:
obj4.isnull()

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [21]:
obj4.notnull()

california    False
ohio           True
oregon         True
texas          True
dtype: bool

In [22]:
obj3

ohio      35000
texas     71000
oregon    16000
utah       5000
dtype: int64

In [23]:
obj4

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [24]:
obj3+obj4

california         NaN
ohio           70000.0
oregon         32000.0
texas         142000.0
utah               NaN
dtype: float64

In [25]:
obj4.name = 'population'

In [26]:
obj4.index.name = 'state'

In [27]:
obj4

state
california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
Name: population, dtype: float64

In [28]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [29]:
obj.index = ['Bob','steve','jeff','ryan']

In [30]:
obj

Bob      4
steve    7
jeff    -5
ryan     3
dtype: int64

In [31]:
obj

Bob      4
steve    7
jeff    -5
ryan     3
dtype: int64

In [32]:
obj[:] = [1,2,3,4]         #不能用obj.values来进行更改值，只能用obj[]索引来更改

In [33]:
obj

Bob      1
steve    2
jeff     3
ryan     4
dtype: int32

In [34]:
#dataframe
#创建dataframe
data = {'state':['ohio','ohio','ohio','nevada','nevada','nevada'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [35]:
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [36]:
frame.head()        #只选出头部的五行

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [37]:
pd.DataFrame(data,columns = ['year','state','pop'])         #指定列的顺序

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  nevada  3.2

In [38]:
frame2 = pd.DataFrame(data,columns = ['year','state','pop','debt'],index = ['one','two','three','four','five','six'])    
#当所传的列不存在时，将会在结果中出现缺失值

In [39]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [40]:
#dataframe中的每一列可以通过按字典型索引或者属性检索为series
frame2['state']         #且该方法得到的只是一个数据的视图，对series的修改会映射到dataframe上，所以如果需要复制，应用series的.copy方法

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [42]:
#每一行也可以通过位置或者特殊属性loc进行选取
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [43]:
frame2['debt'] = 16.5

In [44]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5
six    2003  nevada  3.2  16.5

In [45]:
frame2['debt'] = np.arange(6.)

In [46]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0
six    2003  nevada  3.2   5.0

In [47]:
val = pd.Series([-1.2,-1.5,-1.7],index = ['two','four','five'])      #会根据所传的列或者数组的index来对应位置赋值
frame2['debt'] = val

In [48]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7
six    2003  nevada  3.2   NaN

In [49]:
frame2['eastern']  = frame2.state == 'ohio'        #frame.eastern无法创建新的列

In [50]:
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN     True
two    2001    ohio  1.7  -1.2     True
three  2002    ohio  3.6   NaN     True
four   2001  nevada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False
six    2003  nevada  3.2   NaN    False

In [51]:
del  frame2['eastern']

In [52]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [53]:
pop = {'nevada':{2001:2.4,2002:2.9},'ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [54]:
frame3  = pd.DataFrame(pop)

In [55]:
frame3

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [56]:
frame3.T

        2000  2001  2002
nevada   NaN   2.4   2.9
ohio     1.5   1.7   3.6

In [57]:
pd.DataFrame(pop,index = [2001,2002,2003])

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [58]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [59]:
pdata = {'ohio':frame3['ohio'][:-1],'nevada':frame3['nevada'][:2]}
pd.DataFrame(pdata)

      ohio  nevada
2000   1.5     NaN
2001   1.7     2.4

In [60]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [61]:
frame3

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [62]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [63]:
frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7],
       [2003, 'nevada', 3.2, nan]], dtype=object)

In [64]:
#索引对象
obj  = pd.Series(range(3),index = ['a','b','c'])
index = obj.index

In [65]:
index

Index(['a', 'b', 'c'], dtype='object')

In [66]:
index[1:]

Index(['b', 'c'], dtype='object')

In [67]:
index[1] = 'd'        #索引对象是不可变的，因此用户无法修改索引对象

TypeError: Index does not support mutable operations

In [106]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [107]:
obj2 = pd.Series([4.5,-2.5,0],index = labels)

In [108]:
obj2

0    4.5
1   -2.5
2    0.0
dtype: float64

In [109]:
obj2.index is labels

True

In [110]:
frame3

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [111]:
frame3.columns

Index(['nevada', 'ohio'], dtype='object', name='state')

In [112]:
'ohio' in frame3.columns

True

In [113]:
2003 in frame3.index

False

In [114]:
#与python集合不同，pandas索引对象可以包含重复标签
dup_labels = pd.Index(['foo','foo','bar','bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [115]:
dup_labels.unique()

Index(['foo', 'bar'], dtype='object')

In [116]:
dup_labels.is_unique

False

In [117]:
#基本功能
#1.重建索引
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [118]:
#reindex方法用于创建一个符合新索引的新对象
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [119]:
obj3 = pd.Series(['blue','purple','yellow'],index = [0,2,4])

In [120]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [121]:
#对于顺序数据，比如时间序列，在重建索引时可能会进行插值或者填值，method可选参数允许我们使用诸如ffill等方法在重建索引时插值，
#ffill方法会将值前向填充
obj3.reindex(range(6),method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [122]:
#在dataframe中reindex可以改变行索引，列索引，也可以同时改变两者，当仅传入一个序列时，只会重建行索引
frame = pd.DataFrame(np.arange(9).reshape(3,3),index = ['a','b','c'],columns = ['ohio','texas','california'])
frame

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8

In [123]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   ohio  texas  california
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [124]:
states = ['texas','utah','california']
frame.reindex(columns = states)

   texas  utah  california
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [125]:
frame.loc[['a','b','c','d'],states]

E:\Anaconda3\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   texas  utah  california
a    1.0   NaN         2.0
b    4.0   NaN         5.0
c    7.0   NaN         8.0
d    NaN   NaN         NaN

In [126]:
frame2.index = ['b','c','e','f']

In [127]:
frame2

   ohio  texas  california
b   0.0    1.0         2.0
c   3.0    4.0         5.0
e   6.0    7.0         8.0
f   NaN    NaN         NaN

In [128]:
#轴向上删除条目
obj = pd.Series(np.arange(5),index = ['a','b','c','d','e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [129]:
new_obj = obj.drop('c')

In [130]:
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [131]:
obj.drop(['a','c'])

b    1
d    3
e    4
dtype: int32

In [132]:
data = pd.DataFrame(np.arange(16).reshape(4,4),index = ['ohio','colorado','utah','new york'],columns = ['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [133]:
data.drop(['colorado','ohio'])    #在调用drop时会根据行标签来删除值

          one  two  three  four
utah        8    9     10    11
new york   12   13     14    15

In [134]:
data.drop('two',axis =1 )#这里与numpy库中的axis=1不同，numpy中axis=1为横向计数，而此为列标签

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
new york   12     14    15

In [135]:
data.drop(['two','four'],axis= 1)

          one  three
ohio        0      2
colorado    4      6
utah        8     10
new york   12     14

In [136]:
obj.drop('c',inplace = True) #inplace属性会清楚被删除的数据

In [137]:
obj

a    0
b    1
d    3
e    4
dtype: int32

In [138]:
#索引选择和过滤
obj = pd.Series(np.arange(4.),index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [139]:
obj['a']

0.0

In [140]:
obj[1]      series的索引可以不仅仅是字符也可以是整数

SyntaxError: invalid syntax (<ipython-input-140-1d9158a604d3>, line 1)

In [141]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [142]:
obj[['a','b','c']]

a    0.0
b    1.0
c    2.0
dtype: float64

In [143]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [144]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [145]:
#普通的python切片是不包含尾部的，但是series的切片有所不同  ,series切片是包含尾部的
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [146]:
obj['b':'c'] = 5

In [147]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [148]:
data  =pd.DataFrame(np.arange(16).reshape(4,4),index =['ohio','colorado','utah','new york'],columns =['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [149]:
data['two']

ohio         1
colorado     5
utah         9
new york    13
Name: two, dtype: int32

In [150]:
data[['three','one']]

          three  one
ohio          2    0
colorado      6    4
utah         10    8
new york     14   12

In [151]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [152]:
data[data['three']>5]

          one  two  three  four
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [153]:
data<5

            one    two  three   four
ohio       True   True   True   True
colorado   True  False  False  False
utah      False  False  False  False
new york  False  False  False  False

In [154]:
data[data<5]=0

In [155]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [156]:
#使用loc和iloc选择数据
data.loc['colorado',['two','three']]

two      5
three    6
Name: colorado, dtype: int32

In [157]:
data

          one  two  three  four
ohio        0    0      0     0
colorado    0    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [158]:
data.iloc[2,[3,0,1]]        #iloc是整数标签

four    11
one      8
two      9
Name: utah, dtype: int32

In [159]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

In [160]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
colorado     7    0    5
utah        11    8    9

In [161]:
data.loc[:'utah','two']

ohio        0
colorado    5
utah        9
Name: two, dtype: int32

In [162]:
data.iloc[:,:3][data.three>5]

          one  two  three
colorado    0    5      6
utah        8    9     10
new york   12   13     14

In [163]:
#整数索引
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [164]:
ser[-1]      #当标签轴为数字时不能用-1，而当为文字标签时，可以使用

KeyError: -1

In [165]:
ser2 =pd.Series(np.arange(3.),index =['a','b','c'])
ser2[-1]

2.0

In [166]:
#算术与数据对齐
s1 =pd.Series([7.3,-2.5,3.4,1.5],index =['a','c','d','e'])
s2 =pd.Series([-2.1,3.6,-1.5,4,3.1],index =['a','c','e','f','g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [167]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [168]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [169]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns = list('bcd'),index =['ohio','texas','colorado'])
df2 =pd.DataFrame(np.arange(12.).reshape(4,3),columns = list('bde'),index = ['utah','ohio','texas','oregon'])
df1

            b    c    d
ohio      0.0  1.0  2.0
texas     3.0  4.0  5.0
colorado  6.0  7.0  8.0

In [170]:
df2

          b     d     e
utah    0.0   1.0   2.0
ohio    3.0   4.0   5.0
texas   6.0   7.0   8.0
oregon  9.0  10.0  11.0

In [171]:
df1 +df2

            b   c     d   e
colorado  NaN NaN   NaN NaN
ohio      3.0 NaN   6.0 NaN
oregon    NaN NaN   NaN NaN
texas     9.0 NaN  12.0 NaN
utah      NaN NaN   NaN NaN

In [172]:
df1 = pd.DataFrame({'A':[1,2]})
df2 = pd.DataFrame({'B':[3,4]})
df1

   A
0  1
1  2

In [173]:
df2

   B
0  3
1  4

In [174]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [175]:
#使用填充值的算术方法
df1 = pd.DataFrame(np.arange(12).reshape(3,4),columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape(4,5),columns = list('abcde'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [176]:
df2.loc[1,'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [177]:
df1 +df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [178]:
df1.add(df2,fill_value =0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [179]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [180]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [181]:
df1.reindex(columns = df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [182]:
#dataframe和series间的操作
arr =np.arange(12.).reshape(3,4)
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [183]:
arr[0]

array([0., 1., 2., 3.])

In [184]:
arr-arr[0]     #广播体制

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [185]:
frame =pd.DataFrame(np.arange(12).reshape(4,3),columns =list('bde'),index = ['utah','ohio','texas','oregon'])
series =frame.iloc[0]
frame

        b   d   e
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oregon  9  10  11

In [186]:
series

b    0
d    1
e    2
Name: utah, dtype: int32

In [187]:
#默认情况下，dataframe和series的数学操作会将series的索引和dataframe的列进行匹配，并进行广播
frame -series

        b  d  e
utah    0  0  0
ohio    3  3  3
texas   6  6  6
oregon  9  9  9

In [188]:
series2 =pd.Series(range(3),index = ['b','e','f'])
frame+series2

          b   d     e   f
utah    0.0 NaN   3.0 NaN
ohio    3.0 NaN   6.0 NaN
texas   6.0 NaN   9.0 NaN
oregon  9.0 NaN  12.0 NaN

In [189]:
series3 =frame['d']
frame

        b   d   e
utah    0   1   2
ohio    3   4   5
texas   6   7   8
oregon  9  10  11

In [190]:
series3

utah       1
ohio       4
texas      7
oregon    10
Name: d, dtype: int32

In [191]:
frame.sub(series3,axis ='index')

        b  d  e
utah   -1  0  1
ohio   -1  0  1
texas  -1  0  1
oregon -1  0  1

In [192]:
#函数应用与映射
frame =pd.DataFrame(np.random.randn(4,3),columns= list('bde'),index =['utah','ohio','texas','oregon'])
frame

               b         d         e
utah   -0.526504 -0.831706 -0.936497
ohio   -2.271135  0.094912  0.473318
texas   0.397319 -0.188451 -1.162579
oregon  0.438523 -0.551698  0.999771

In [193]:
np.abs(frame)

               b         d         e
utah    0.526504  0.831706  0.936497
ohio    2.271135  0.094912  0.473318
texas   0.397319  0.188451  1.162579
oregon  0.438523  0.551698  0.999771

In [194]:
f =lambda x:x.max() - x.min()
frame.apply(f)         #h函数f可以计算series的最大值和最小值的差，会被frame中的每一列调用一次，结果是一个以frame的列作为索引的series

b    2.709658
d    0.926618
e    2.162350
dtype: float64

In [195]:
frame.apply(f,axis= 'columns')

utah      0.409994
ohio      2.744453
texas     1.559898
oregon    1.551469
dtype: float64

In [196]:
def f(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])
frame.apply(f)

            b         d         e
min -2.271135 -0.831706 -1.162579
max  0.438523  0.094912  0.999771

In [197]:
format = lambda x:'%.2f'%x          #格式化字符串
frame.applymap(format)

            b      d      e
utah    -0.53  -0.83  -0.94
ohio    -2.27   0.09   0.47
texas    0.40  -0.19  -1.16
oregon   0.44  -0.55   1.00

In [198]:
frame['e'].map(format)

utah      -0.94
ohio       0.47
texas     -1.16
oregon     1.00
Name: e, dtype: object

In [199]:
#排序和排名
obj = pd.Series(range(4),index = ['d','a','b','c'])
obj.sort_index()      #按行或者列索引进行字典型排序，需要使用sort_index（）方法，该方法返回一个新的排序好的对象

a    1
b    2
c    3
d    0
dtype: int64

In [200]:
frame =pd.DataFrame(np.arange(8).reshape(2,4),index = ['three','one'],columns = ['d','a','b','c'])
frame.sort_index()       #默认按行索引进行排序

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [201]:
frame.sort_index(axis = 1)   #按列索引进行排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [202]:
frame.sort_index(axis =1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [203]:
obj = pd.Series([4,7,-3,2])
obj.sort_values()          #按值进行排序

2   -3
3    2
0    4
1    7
dtype: int64

In [204]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()          #缺省值默认排最后

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [205]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [206]:
frame.sort_values(by = 'b')      #按照某列或者多个列的值来排序

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [207]:
frame.sort_values(by = ['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [208]:
obj = pd.Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [209]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [210]:
obj.rank(ascending =False,method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [211]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [212]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [213]:
#含有重复标签的轴索引
obj = pd.Series(range(5),index = ['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [214]:
obj.index.is_unique

False

In [215]:
obj['a']

a    0
a    1
dtype: int64

In [216]:
obj['c']

4

In [217]:
df =pd.DataFrame(np.random.randn(4,3),index =['a','a','b','b'])
df

          0         1         2
a -1.859551 -0.632512 -0.278333
a -0.354727  0.699263  0.078121
b -2.124051  0.964150  1.876059
b  0.530873  2.653814  0.028383

In [218]:
df.loc['b']

          0         1         2
b -2.124051  0.964150  1.876059
b  0.530873  2.653814  0.028383

In [219]:
#描述性统计的概述与计算

In [220]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5,],[np.nan,np.nan],[0.75,-1.3]],index = list('abcd'),columns = ['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [221]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [222]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [223]:
df.mean(axis = 1,skipna =False)  #禁用skinap来实现不排除na值

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [224]:
df.idxmax()      #返回最大值或者最小值的索引

one    b
two    d
dtype: object

In [225]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [226]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [227]:
import pandas_datareader.data as web

In [229]:
all_data = {ticker:web.get_data_yahoo(ticker)}
for ticker in ['AAPL','IBM','MSFT','GOOG']
    price = pd.DataFrame({ticker:data['Adj Close'] for ticker,data in all_data.items()})

NameError: name 'ticker' is not defined

In [ ]:
#return['MSFT'].corr(return['IBM'])  corr方法计算两个series的中重叠的，非na的按索引对齐的值得相关性
#return['MSFT'].cov(return['IBM'])    cov方法计算的是协方差

In [ ]:
#return.corr  .cov返回相关性和协方差矩阵

In [ ]:
#return.corrwith(returns.IBM) 传入一个series会返回一个含有每列计算相关性值得series

In [230]:
#唯一值，计数和成员属性
obj =pd.Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique()      #给出series中的唯一值
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [231]:
obj.value_counts()      #计算seires中包含的值得个数

c    3
a    3
b    2
d    1
dtype: int64

In [232]:
pd.value_counts(obj.values,sort  = False)

b    2
a    3
c    3
d    1
dtype: int64

In [233]:
mask = obj.isin(['b','c'])

In [234]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [235]:
to_match = pd.Series(['c','a','b','b','c','a'])
unique_vals = pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [236]:
data = pd.DataFrame({'qu1':[1,3,4,3,4],'qu2':[2,3,1,2,3],'qu3':[1,5,2,4,4]})
data

   qu1  qu2  qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [237]:
result  = data.apply(pd.value_counts).fillna(0)
result

   qu1  qu2  qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [238]:
########

In [1]:
#数据载入，存储及文件格式
!type example.csv
import pandas as pd

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [2]:
df = pd.read_csv('example.csv')

In [3]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('example.csv',sep = ',')

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_csv('example.csv',header = None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [6]:
pd.read_csv('example.csv',names = ['a','b','c','d','message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [7]:
names = ['a','b','c','d','message']
pd.read_csv('example.csv',names = names,index_col = 'message') #使得message列成为索引

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
!type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [14]:
names = ['a','b','c','d','message']
parsed = pd.read_csv('csv_mindex.csv',index_col = ['key1','key2'])   #建立分层索引
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [18]:
parsed.loc['one'].loc['a']

value1    1
value2    2
Name: a, dtype: int64

In [19]:
list(open('ex3.csv'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491']

In [20]:
pd.read_csv('ex3.csv',sep = '\s+')        #sep中可以写字符串或者正则表达式，\s+表示不同同数量的空格

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
!type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [22]:
pd.read_csv('ex4.csv',skiprows = [0,2,3])  #skiprows可选参数用于跳过不需要读入的行

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [26]:
result = pd.read_csv('ex5.csv')        #缺失值处理

In [27]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [28]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [29]:
result = pd.read_csv('ex5.csv',na_values = ['NULL'])

In [30]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [31]:
sentinels  = {'message': ['foo','NA'],'something':['two']}
pd.read_csv('ex5.csv',na_values = sentinels)        #每列指定不同的缺失值标识

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [32]:
###分块读入文件，在尝试大文件之前，我们可以先对pandas的显示设置进行调整，使之更为紧凑
pd.options.display.max_rows = 10
result =pd.read_csv('ex6.csv')

In [33]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [34]:
pd.read_csv('ex6.csv',nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [35]:
#可以指定chunksize来作为每一块的行数 ,read_csv返回的textparser运行你根据chunksize进行遍历文件
chunker = pd.read_csv('ex6.csv',chunksize = 1000)
chunker

In [39]:
tot = pd.Series([])
tot

Series([], dtype: float64)

In [48]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value = 0)
tot = tot.sort_values(ascending = False)
tot[:]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

In [47]:
len(tot)

36

In [49]:
#将数据写入文本格式
data = pd.read_csv('ex5.csv')

In [50]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [51]:
data.to_csv('exout.csv')      #默认用，作分隔符

In [52]:
!type exout.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [53]:
#用其他符号作分隔符
import sys
data.to_csv(sys.stdout,sep = "|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [55]:
data.to_csv('exo.csv',na_rep  = 'NULL')#使缺失值导出时为null

In [56]:
!type exo.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [57]:
data.to_csv(sys.stdout,index =False,header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [58]:
data.to_csv(sys.stdout,index = False,columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [61]:
import numpy as np 
dates = pd.date_range('1/1/2000',periods = 7)
ts =pd.Series(np.arange(7),index = dates)
ts.to_csv('tsseries.csv')
!type tsseries.csv

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  after removing the cwd from sys.path.

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [62]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [63]:
##使用分隔形式
!type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [2]:
import csv
f = open('ex7.csv')
reader  =csv.reader(f)
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [8]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [4]:
header,values = lines[0],lines[1:]
data_dict = {h:v for h,v in zip(header,zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [5]:
list(zip(*values))

[('1', '1'), ('2', '2'), ('3', '3')]

In [17]:
import numpy as np
import pandas as pd
import csv
with open('ex7.csv') as f:
    reader = csv.reader(f,delimiter = '|')
    x = list(reader)
x

[['a,"b","c"'], ['1,"2","3"'], ['1,"2","3"']]

In [11]:
with open('mydata.csv','w') as f:
    writer  = csv.writer(f,dialect = my_dialect)
    writer.writerow('one','two','three')
    writer.writerow('1','2','3')
    writer.writerow('4','5','6')
    writer.writerow('7','8','9')

TypeError: quotechar must be set if quoting enabled

In [18]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
import json
result  = json.loads(obj)       
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [19]:
asjson = json.dumps(result)
siblings = pd.DataFrame(result['siblings'],columns = ['name','age'])

In [20]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [21]:
!type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [22]:
data = pd.read_json('example.json')

In [23]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [24]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [25]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [1]:
import pandas as pd
import numpy as np

tables = pd.read_html('fdic_failed_bank_list.html')
len(tables)

1

In [2]:
failures = tables[0]

In [3]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [11]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [8]:
frame = pd.read_csv('ex1.csv')

In [9]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
frame.to_pickle('frame_pickles')

In [12]:
pd.read_pickle('frame_pickles')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
frame = pd.DataFrame({'a':np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [14]:
store['obj1']

           a
0   1.340035
1   1.434930
2   1.576199
3   1.464594
4   1.449718
5  -1.134651
6  -1.111826
7  -0.432375
8   1.769387
9   1.536628
10  0.940473
11  1.187844
12  1.088747
13  0.459508
14 -0.002939
15  0.846050
16 -1.183939
17 -0.249448
18 -0.460023
19  1.995922
20  0.405969
21 -0.901974
22  0.112463
23 -0.330767
24 -0.405459
25 -0.032142
26 -0.140682
27 -0.747935
28 -0.670631
29  2.340635
..       ...
70 -0.616526
71 -1.495623
72  0.100125
73  0.450745
74 -0.248935
75 -0.575542
76 -0.636805
77  0.408602
78 -0.311736
79 -0.678521
80 -2.528634
81  1.073199
82 -1.427072
83 -1.356788
84 -1.319276
85  1.128081
86  0.605439
87 -1.495751
88  0.692867
89  0.704050
90  0.338283
91 -0.800061
92  1.518716
93  0.262822
94 -0.846427
95 -1.130851
96 -1.689260
97  1.685339
98  0.981436
99  2.515648

[100 rows x 1 columns]

In [15]:
frame

           a
0   1.340035
1   1.434930
2   1.576199
3   1.464594
4   1.449718
5  -1.134651
6  -1.111826
7  -0.432375
8   1.769387
9   1.536628
10  0.940473
11  1.187844
12  1.088747
13  0.459508
14 -0.002939
15  0.846050
16 -1.183939
17 -0.249448
18 -0.460023
19  1.995922
20  0.405969
21 -0.901974
22  0.112463
23 -0.330767
24 -0.405459
25 -0.032142
26 -0.140682
27 -0.747935
28 -0.670631
29  2.340635
..       ...
70 -0.616526
71 -1.495623
72  0.100125
73  0.450745
74 -0.248935
75 -0.575542
76 -0.636805
77  0.408602
78 -0.311736
79 -0.678521
80 -2.528634
81  1.073199
82 -1.427072
83 -1.356788
84 -1.319276
85  1.128081
86  0.605439
87 -1.495751
88  0.692867
89  0.704050
90  0.338283
91 -0.800061
92  1.518716
93  0.262822
94 -0.846427
95 -1.130851
96 -1.689260
97  1.685339
98  0.981436
99  2.515648

[100 rows x 1 columns]

In [17]:
store['obj1_col']

0     1.340035
1     1.434930
2     1.576199
3     1.464594
4     1.449718
5    -1.134651
6    -1.111826
7    -0.432375
8     1.769387
9     1.536628
10    0.940473
11    1.187844
12    1.088747
13    0.459508
14   -0.002939
15    0.846050
16   -1.183939
17   -0.249448
18   -0.460023
19    1.995922
20    0.405969
21   -0.901974
22    0.112463
23   -0.330767
24   -0.405459
25   -0.032142
26   -0.140682
27   -0.747935
28   -0.670631
29    2.340635
        ...
70   -0.616526
71   -1.495623
72    0.100125
73    0.450745
74   -0.248935
75   -0.575542
76   -0.636805
77    0.408602
78   -0.311736
79   -0.678521
80   -2.528634
81    1.073199
82   -1.427072
83   -1.356788
84   -1.319276
85    1.128081
86    0.605439
87   -1.495751
88    0.692867
89    0.704050
90    0.338283
91   -0.800061
92    1.518716
93    0.262822
94   -0.846427
95   -1.130851
96   -1.689260
97    1.685339
98    0.981436
99    2.515648
Name: a, Length: 100, dtype: float64

In [18]:
store['obj2']

           a
0   1.324210
1   0.770813
2   0.554799
3  -1.741867
4  -1.875071
5  -0.838120
6   1.273414
7   0.550003
8   0.674975
9   0.349757
10 -1.186667
11  0.628998
12 -0.668921
13  0.775731
14 -1.329899
15  1.920832
16 -2.251441
17 -1.131568
18 -0.849310
19  0.311579
20 -1.961339
21  0.565227
22 -1.776465
23 -0.838674
24  0.254368
25  0.436531
26  0.017972
27 -0.121042
28 -0.192816
29  1.450673
..       ...
70  0.002393
71 -0.140888
72 -0.926906
73  0.103666
74 -0.178839
75 -1.607683
76  0.456371
77 -1.154552
78 -0.881490
79 -1.909448
80  0.379182
81  1.699979
82  0.859218
83  0.314085
84  0.351360
85 -0.075607
86  0.870379
87  0.177660
88  0.039481
89  0.604648
90 -0.193451
91  1.143296
92  0.114920
93  0.068700
94  0.569396
95  0.248392
96 -0.774459
97 -0.675556
98  0.324861
99 -2.326224

[100 rows x 1 columns]

In [19]:
store['obj3']

           a
0   1.324210
1   0.770813
2   0.554799
3  -1.741867
4  -1.875071
5  -0.838120
6   1.273414
7   0.550003
8   0.674975
9   0.349757
10 -1.186667
11  0.628998
12 -0.668921
13  0.775731
14 -1.329899
15  1.920832
16 -2.251441
17 -1.131568
18 -0.849310
19  0.311579
20 -1.961339
21  0.565227
22 -1.776465
23 -0.838674
24  0.254368
25  0.436531
26  0.017972
27 -0.121042
28 -0.192816
29  1.450673
..       ...
70  0.002393
71 -0.140888
72 -0.926906
73  0.103666
74 -0.178839
75 -1.607683
76  0.456371
77 -1.154552
78 -0.881490
79 -1.909448
80  0.379182
81  1.699979
82  0.859218
83  0.314085
84  0.351360
85 -0.075607
86  0.870379
87  0.177660
88  0.039481
89  0.604648
90 -0.193451
91  1.143296
92  0.114920
93  0.068700
94  0.569396
95  0.248392
96 -0.774459
97 -0.675556
98  0.324861
99 -2.326224

[100 rows x 1 columns]

In [20]:
store.put('obj2',frame,format ='table')
store.select('obj2',where = ['index>=10 and index<=15'])

           a
10  0.940473
11  1.187844
12  1.088747
13  0.459508
14 -0.002939
15  0.846050

In [22]:
frame.to_hdf('myda.h5','obj3',format = 'table')
pd.read_hdf('myda.h5','obj3',where = ['index<5'])

          a
0  1.340035
1  1.434930
2  1.576199
3  1.464594
4  1.449718

In [24]:
xlsx = pd.ExcelFile('ex1.xlsx')
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [30]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [34]:
data=resp.json()
data[0]['title']

'Using .loc.__setitem__ with integer slices does not raise'

In [35]:
issues = pd.DataFrame(data,columns= ['number','title','labels','state'])
issues

,number,title,labels,state
0,26412,Using .loc.__setitem__ with integer slices doe...,[],open
1,26411,"Grouping, then resampling empty DataFrame lead...",[],open
2,26410,"API: getting the ""densified"" values of a Categ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
3,26409,DEPR: deprecate get_values,[],open
4,26408,BUG: MultiIndex not dropping nan level and inv...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
5,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
6,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
8,26404,Fix type annotations in pandas.core.indexes.da...,[],open
9,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
10,26400,ENH: Support multiple opening hours intervals ...,[],open
11,26399,ENH: Support nested renaming / selection,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
12,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
13,26397,DataFrame.describe excludes top and freq for e...,[],open
14,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
15,26394,BUG: to_numeric does not validate the errors k...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
16,26393,Holiday based on the lunar calendar?,[],open
17,26392,[TEST] Add two more parameters to the test_dti...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
18,26391,[PERF] Get rid of MultiIndex conversion in Int...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
19,26390,BUG: assigning Series.array / PandasArray to c...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
20,26389,Converting json to csv,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
21,26388,read_parquet S3 dir support,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
22,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
23,26383,Prefixed batch script commands with call,[],open
24,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,26380,ENH: Implementing NEP 18's __array_function__,[],open
26,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,26377,Fix type annotations in pandas.core.ops,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
28,26376,pd.read_fwf fails with file pointer to url,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
29,26374,BUG: ngroups and len(groups) do not equal when...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open

In [37]:
data[0]

{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26412',
 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas',
 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26412/labels{/name}',
 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26412/comments',
 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/26412/events',
 'html_url': 'https://github.com/pandas-dev/pandas/issues/26412',
 'id': 444451632,
 'node_id': 'MDU6SXNzdWU0NDQ0NTE2MzI=',
 'number': 26412,
 'title': 'Using .loc.__setitem__ with integer slices does not raise',
 'user': {'login': 'lumbric',
  'id': 691772,
  'node_id': 'MDQ6VXNlcjY5MTc3Mg==',
  'avatar_url': 'https://avatars3.githubusercontent.com/u/691772?v=4',
  'gravatar_id': '',
  'url': 'https://api.github.com/users/lumbric',
  'html_url': 'https://github.com/lumbric',
  'followers_url': 'https://api.github.com/users/lumbric/followers',
  'following_url': 'https://api.github.com/users/lumbric/following{/other_user}',
  'gists_url': 'https://api.github.com/users/lumbric/gists{/gist_id}',
  'starred_url': 'https://api.github.com/users/lumbric/starred{/owner}{/repo}',
  'subscriptions_url': 'https://api.github.com/users/lumbric/subscriptions',
  'organizations_url': 'https://api.github.com/users/lumbric/orgs',
  'repos_url': 'https://api.github.com/users/lumbric/repos',
  'events_url': 'https://api.github.com/users/lumbric/events{/privacy}',
  'received_events_url': 'https://api.github.com/users/lumbric/received_events',
  'type': 'User',
  'site_admin': False},
 'labels': [],
 'state': 'open',
 'locked': False,
 'assignee': None,
 'assignees': [],
 'milestone': None,
 'comments': 0,
 'created_at': '2019-05-15T13:51:49Z',
 'updated_at': '2019-05-15T13:51:49Z',
 'closed_at': None,
 'author_association': 'NONE',
 'body': "#### Code Sample\r\n\r\n```python\r\n>>> d = pd.DataFrame({'a': range(5), 'b': range(2,7), 'c': range(3,8)})\r\n>>> d\r\n   a  b  c\r\n0  0  2  3\r\n1  1  3  4\r\n2  2  4  5\r\n3  3  5  6\r\n4  4  6  7\r\n>>> d.loc[0:2, 0:2] = 42   # note that loc is used with an integer slice! should this raise?\r\n>>> d  # this is somehow the expected result\r\n    a   b  c\r\n0  42  42  3\r\n1  42  42  4\r\n2  42  42  5\r\n3   3   5  6\r\n4   4   6  7\r\n>>> d.iloc[0:2, 0:2]        # expected result\r\n    a   b\r\n0  42  42\r\n1  42  42\r\n>>> d.loc[0:2, 0:2]        # this is the same syntax as above, but raises\r\n...\r\nTypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>\r\n```\r\n#### Problem description\r\n\r\nI'd expect a symmetry in `d.loc.__getitem__` and `d.loc.__setitem__`. At the moment only __getitem__ raises if integer slices are passed. Usage of `.loc` was probably a mistake, instead `.iloc` should have been used. Even if it works correctly, it is confusing for users.\r\n\r\nProbably this is simply a missing exception in the special case of `d.loc.__setitem__` being called with integer slices. \r\n\r\nSee #13831 for a very similar problems with `pd.Series`.\r\n\r\n#### Expected Output\r\n\r\nAssuming `d.loc.__getitem__` should raise for integer slices (as it does), then also `d.loc.__setitem__` should raise:\r\n\r\n```\r\n>>> d.loc[0:2, 0:2]\r\n...\r\nSomException: int & loc don't go together\r\n```\r\n\r\n#### Output of ``pd.show_versions()``\r\n\r\n<details>\r\nINSTALLED VERSIONS\r\n------------------\r\ncommit: None\r\npython: 3.6.8.final.0\r\npython-bits: 64\r\nOS: Linux\r\nOS-release: 4.18.0-20-generic\r\nmachine: x86_64\r\nprocessor: x86_64\r\nbyteorder: little\r\nLC_ALL: None\r\nLANG: en_US.UTF-8\r\nLOCALE: en_US.UTF-8\r\n\r\npandas: 0.24.2\r\npytest: 3.6.4\r\npip: 9.0.1\r\nsetuptools: 40.8.0\r\nCython: None\r\nnumpy: 1.16.2\r\nscipy: 1.2.1\r\npyarrow: None\r\nxarray: 0.11.3\r\nIPython: 5.5.0\r\nsphinx: 1.7.9\r\npatsy: 0.4.1+dev\r\ndateutil: 2.8.0\r\npytz: 2019.1\r\nblosc: 1.5.1\r\nbottleneck: 1.2.1\r\ntables: 3.4.4\r\nnumexpr: 2.6.5\r\nfeather: None\r\nmatplotlib: 2.2.2\r\nopenpyxl: None\r\nxlrd: None\r\nxlwt: None\r\nxlsxwriter: None\r\nlxml.etree: 4.2.5\r\nbs4: 4.5.0\r\nhtml5lib: 0.999999999\r\nsqlalchemy: None\r\npymysql: None\r\npsycopg2: 2.7.5 (dt dec pq3 ext lo64)\r\njinja2: 2.10\r\ns3fs: None\r\nfastparquet: None\r\npandas_gbq: None\r\npandas_datareader: None\r\ngcsfs: None\r\n</details>"}

In [38]:
import sqlite3

In [48]:
query = """CREATE TABLE test (a VARCHAR(20), b VARCHAR(20),c REAL,        d INTEGER);"""

In [49]:
con = sqlite3.connect('mydata.sqlite')

In [50]:
con.execute(query)

OperationalError: table test already exists

In [44]:
con.commit()

In [51]:
data = [('Atlanta', 'Georgia', 1.25, 6),
   .....:         ('Tallahassee', 'Florida', 2.6, 3),
   .....:         ('Sacramento', 'California', 1.7, 5)]

In [52]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [53]:
con.executemany(stmt, data)

In [54]:
cursor = con.execute('select * from test')

In [55]:
rows = cursor.fetchall()

In [56]:
 rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [57]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [58]:
 pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [59]:
import sqlalchemy as sqla

In [60]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [61]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5